#+TITLE: Formatter library for [[https://pursuit.purescript.org/packages/purescript-react-basic/][React-Basic]]
#+PROPERTY: header-args :eval never-export

*** Spago

 If you use spago, add this snippet to your ~additions~ section in ~packages.dhall~:

 #+BEGIN_SRC sh :exports results :results output
 cat <<EOF
 react-basic-textf =
   { dependencies =
     [ "foreign"
     , "maybe"
     , "react-basic"
     , "unsafe-coerce"
     ]
   , repo = "https://github.com/j-keck/purescript-react-basic-textf.git"
   , version = "$(git describe --tags --match 'v*')"
   }
 EOF
 #+END_SRC

 #+RESULTS:
 #+begin_example
 react-basic-textf =
   { dependencies =
     [ "foreign"
     , "maybe"
     , "react-basic"
     , "unsafe-coerce"
     ]
   , repo = "https://github.com/j-keck/purescript-react-basic-textf.git"
   , version = "v0.2.0"
   }
 #+end_example


 And then use ~spago install react-basic-textf~ to install this library.


